# Выполнить логические побитовые операции "И", "ИЛИ" и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
log_and = 5 & 6
log_or = 5 | 6
log_xor = 5 ^ 6
left = 5 >> 2
right = 5 << 2
print(f'{bin(5)} = 5, {bin(6)} = 6')
print(f'{bin(log_or)} = {log_or} - логическое или чисел 5 и 6')
print(f'{bin(log_and)} = {log_and} - логическое и чисел 5 и 6')
print(f'{bin(log_xor)} = {log_xor} - логическое исключающее или чисел 5 и 6')
print(f'{left} = {bin(left)} - сдвиг влево, {right} = {bin(right)} - сдвиг вправо')
